// import styles from "../../app/page.module.css";

// export default function BenefitsBlock() {
//     return (
//         <section className={styles.section}>
//             <h2 className={styles.sectionTitle}>ToolNext — платформа для швидкої та зручної оренди інструментів</h2>
//             <p>ToolNext допомагає знайти потрібний інструмент у декілька кліків.
//                 Користувачі можуть легко орендувати обладнання для ремонту чи хобі, а власники — зручно керувати своїми оголошеннями.
//                 Ми створили сервіс, щоб зробити процес оренди простим, доступним і вигідним для всіх.</p>
//             <ul>
//                 <li>
//                     <svg width="24" height="24">
//                         <use href="/sprite/sprite.svg#icon-service_toolbox" />
//                     </svg>
//                     <h3>Легкий доступ до інструментів</h3>
//                     <p>Знаходьте потрібний інструмент у своєму районі без зайвих дзвінків і пошуків. Просто введіть назву — і отримайте варіанти поруч із вами.</p>
//                 </li>
//                 <li>
//                 <svg width="24" height="24">
//                         <use href="/sprite/sprite.svg#icon-checkbook" />
//                     </svg>
//                     <h3>Швидке бронювання</h3>
//                     <p>Бронюйте інструменти в кілька кліків. Жодних складних форм чи довгих очікувань — тільки простий та зручний процес.</p>
//                 </li>
//                 <li>
//                 <svg width="24" height="24">
//                         <use href="/sprite/sprite.svg#icon-manage_accounts" />
//                     </svg>
//                     <h3>Зручне управління</h3>
//                     <p>Додавайте свої інструменти в каталог, редагуйте оголошення та контролюйте оренду. ToolNext допомагає перетворити зайві інструменти на додатковий дохід.</p>
//                 </li>
//             </ul>
//         </section>
//     );
// }
